src/cf/DataProcessors/ТорговаяКонсоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ТорговаяКонсоль</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяПланета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланетаПрейскуранта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьТрюма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноВТрюме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенегВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрюмКорабля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ТорговаяКонсоль/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьКонсоль();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПланетаПрейскурантаПриИзменении(Элемент)
	
	ОбновитьКонсоль();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Купить(Команда)
	
	ТекущаяСтрока = Элементы.Магазин.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КупитьНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Продать(Команда)
	
	ТекущаяСтрока = Элементы.ТрюмКорабля.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПродатьНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КупитьНаСервере(ИдентификаторСтрокиМагазина)
	
	ТекущаяСтрока = Объект.Магазин.НайтиПоИдентификатору(ИдентификаторСтрокиМагазина);
	
	Если Объект.Количество = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Выберите количество!'");
	КонецЕсли;
	
	Если Объект.Количество > Объект.СвободноВТрюме Тогда
		ВызватьИсключение НСтр("ru = 'Вместимости не достаточно!'");
	КонецЕсли;
	
	Если ТекущаяСтрока.ЦенаПокупки * Объект.Количество > Объект.ДенегВНаличии Тогда
		ВызватьИсключение НСтр("ru = 'Денег не достаточно!'");
	КонецЕсли;
	
	Панета = Объект.ТекущаяПланета;
	Товар = ТекущаяСтрока.Товар;
	Количество = Объект.Количество;
	ЦенаПокупка = ТекущаяСтрока.ЦенаПокупки;
	ТорговаяКонсольПереопределяемый.ПокупкаТовара(Панета, Товар, Количество, ЦенаПокупка);
	
	ОбновитьКонсоль();
	
КонецПроцедуры

&НаСервере
Процедура ПродатьНаСервере(ИдентификаторСтрокиТрюма)
	
	ТекущаяСтрока = Объект.ТрюмКорабля.НайтиПоИдентификатору(ИдентификаторСтрокиТрюма);
	
	Если Объект.Количество = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Выберите количество!'");
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Товар", ТекущаяСтрока.Товар);
	СтрокиМагазина = Объект.Магазин.НайтиСтроки(Отбор);
	
	Панета = Объект.ТекущаяПланета;
	Товар = ТекущаяСтрока.Товар;
	Количество = Объект.Количество;
	ЦенаПокупка = СтрокиМагазина[0].ЦенаПродажи;
	ТорговаяКонсольПереопределяемый.ПродажаТовара(Панета, Товар, Количество, ЦенаПокупка);
	
	ОбновитьКонсоль();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонсоль()
	
	Покупатель = Новый Структура;
	Покупатель.Вставить("ТекущаяПланета", Справочники.Планеты.ПустаяСсылка());
	Покупатель.Вставить("ДенегВНаличии", 0);
	Покупатель.Вставить("СвободноВТрюме", 0);
	Покупатель.Вставить("ВместимостьТрюма", 0);
	Покупатель.Вставить("ТрюмКорабля", Новый ТаблицаЗначений);
	Покупатель.ТрюмКорабля.Колонки.Добавить("Товар");
	Покупатель.ТрюмКорабля.Колонки.Добавить("Объем");
	Покупатель.ТрюмКорабля.Колонки.Добавить("Себестоимость");
	
	ТорговаяКонсольПереопределяемый.ПриОпределенииПокупателя(Покупатель);
	Объект.ТекущаяПланета = Покупатель.ТекущаяПланета;
	Объект.ДенегВНаличии = Покупатель.ДенегВНаличии;
	Объект.СвободноВТрюме = Покупатель.СвободноВТрюме;
	Объект.ВместимостьТрюма = Покупатель.ВместимостьТрюма;
	Объект.ТрюмКорабля.Загрузить(Покупатель.ТрюмКорабля);
	
	Если ЗначениеЗаполнено(Объект.ПланетаПрейскуранта) Тогда
		Планета = Объект.ПланетаПрейскуранта;
		Элементы.ПанельТоргови.Доступность = Ложь;
		Элементы.Блокировка.Видимость = Истина;
	Иначе
		Планета = Объект.ТекущаяПланета;
		Элементы.ПанельТоргови.Доступность = Истина;
		Элементы.Блокировка.Видимость = Ложь;
	КонецЕсли;
	
	СтоимостиТоваровНаПланете = Обработки.ТорговаяКонсоль.СтоимостиТоваровНаПланете(Планета);
	Объект.Магазин.Загрузить(СтоимостиТоваровНаПланете);
	
КонецПроцедуры

#КонецОбласти
